olegator1506/audio/progs/esp32-adau/lib/adau17x/projects/sample-direct_IC_1_REG.h
/* DSP Run Register  - Registers (IC 1) */
#define REG_DSP_RUN_REGISTER_IC_1_ADDR            0x40F6
#define REG_DSP_RUN_REGISTER_IC_1_BYTE            1
#define REG_DSP_RUN_REGISTER_IC_1_VALUE           0x1

/* DSP Slew Modes  - Registers (IC 1) */
#define REG_DSP_SLEW_MODES_IC_1_ADDR              0x40F7
#define REG_DSP_SLEW_MODES_IC_1_BYTE              1
#define REG_DSP_SLEW_MODES_IC_1_VALUE             0x0

/* Serial Port Sample Rate Setting  - Registers (IC 1) */
#define REG_SERIAL_PORT_SAMPLE_RATE_SETTING_IC_1_ADDR 0x40F8
#define REG_SERIAL_PORT_SAMPLE_RATE_SETTING_IC_1_BYTE 1
#define REG_SERIAL_PORT_SAMPLE_RATE_SETTING_IC_1_VALUE 0x0

/* Clock Enable Reg 0  - Registers (IC 1) */
#define REG_CLOCK_ENABLE_REG_0_IC_1_ADDR          0x40F9
#define REG_CLOCK_ENABLE_REG_0_IC_1_BYTE          1
#define REG_CLOCK_ENABLE_REG_0_IC_1_VALUE         0x7F

/* Clock Enable Reg 1  - Registers (IC 1) */
#define REG_CLOCK_ENABLE_REG_1_IC_1_ADDR          0x40FA
#define REG_CLOCK_ENABLE_REG_1_IC_1_BYTE          1
#define REG_CLOCK_ENABLE_REG_1_IC_1_VALUE         0x3


/*
 *
 * Control register's field descriptions
 *
 */

/* ClkCtrlRegister (IC 1) */
#define R0_MCLK_ENA_IC_1                          0x1    /* 1b	[0] */
#define R0_INPUT_MCLK_FREQ_IC_1                   0x3    /* 11b	[2:1] */
#define R0_CLK_SOURCE_SEL_IC_1                    0x1    /* 1b	[3] */
#define R0_MCLK_ENA_IC_1_MASK                     0x1
#define R0_MCLK_ENA_IC_1_SHIFT                    0
#define R0_INPUT_MCLK_FREQ_IC_1_MASK              0x6
#define R0_INPUT_MCLK_FREQ_IC_1_SHIFT             1
#define R0_CLK_SOURCE_SEL_IC_1_MASK               0x8
#define R0_CLK_SOURCE_SEL_IC_1_SHIFT              3

/* RegPowCtrlRegister (IC 1) */
#define R1_REGPOWCTRL_IC_1                        0x0    /* 0b	[0] */
#define R1_REGPOWCTRL_IC_1_MASK                   0x1
#define R1_REGPOWCTRL_IC_1_SHIFT                  0

/* PLLCrlRegister (IC 1) */
#define R2_PLL_POWER_DOWN_IC_1                    0x1    /* 1b	[0] */
#define R2_PLL_LOCK_IC_1                          0x0    /* 0b	[1] */
#define R2_PLL_TYPE_IC_1                          0x0    /* 0b	[8] */
#define R2_INPUT_DIVIDER_IC_1                     0x0    /* 00b	[10:9] */
#define R2_R_FEEDBACK_IC_1                        0x4    /* 0100b	[14:11] */
#define R2_N_NUMERATOR_IC_1                       0x000C /* 0000000000001100b	[31:16] */
#define R2_M_DENOMINATOR_IC_1                     0x00FD /* 0000000011111101b	[47:32] */
#define R2_PLL_POWER_DOWN_IC_1_MASK               0x1
#define R2_PLL_POWER_DOWN_IC_1_SHIFT              0
#define R2_PLL_LOCK_IC_1_MASK                     0x2
#define R2_PLL_LOCK_IC_1_SHIFT                    1
#define R2_PLL_TYPE_IC_1_MASK                     0x100
#define R2_PLL_TYPE_IC_1_SHIFT                    8
#define R2_INPUT_DIVIDER_IC_1_MASK                0x600
#define R2_INPUT_DIVIDER_IC_1_SHIFT               9
#define R2_R_FEEDBACK_IC_1_MASK                   0x7800
#define R2_R_FEEDBACK_IC_1_SHIFT                  11
#define R2_N_NUMERATOR_IC_1_MASK                  0xFFFF0000
#define R2_N_NUMERATOR_IC_1_SHIFT                 16
#define R2_M_DENOMINATOR_IC_1_MASK                0xFFFF00000000
#define R2_M_DENOMINATOR_IC_1_SHIFT               32

/* MicCtrlRegister (IC 1) */
#define R3_JACK_POLARITY_IC_1                     0x0    /* 0b	[0] */
#define R3_JACK_DETECT_MIC_IN_IC_1                0x0    /* 00b	[5:4] */
#define R3_JACK_DEBOUNCE_TIME_IC_1                0x0    /* 00b	[7:6] */
#define R3_JACK_POLARITY_IC_1_MASK                0x1
#define R3_JACK_POLARITY_IC_1_SHIFT               0
#define R3_JACK_DETECT_MIC_IN_IC_1_MASK           0x30
#define R3_JACK_DETECT_MIC_IN_IC_1_SHIFT          4
#define R3_JACK_DEBOUNCE_TIME_IC_1_MASK           0xC0
#define R3_JACK_DEBOUNCE_TIME_IC_1_SHIFT          6

/* Record Pwr Management (IC 1) */
#define R4_FRONT_END_BIAS_IC_1                    0x0    /* 00b	[2:1] */
#define R4_ADC_BIAS_CONTROL_IC_1                  0x0    /* 00b	[4:3] */
#define R4_MIXER_AMP_BOOST_IC_1                   0x0    /* 00b	[6:5] */
#define R4_FRONT_END_BIAS_IC_1_MASK               0x6
#define R4_FRONT_END_BIAS_IC_1_SHIFT              1
#define R4_ADC_BIAS_CONTROL_IC_1_MASK             0x18
#define R4_ADC_BIAS_CONTROL_IC_1_SHIFT            3
#define R4_MIXER_AMP_BOOST_IC_1_MASK              0x60
#define R4_MIXER_AMP_BOOST_IC_1_SHIFT             5

/* Record Mixer Left Ctrl 0 (IC 1) */
#define R5_ENABLE_MIXER_IC_1                      0x1    /* 1b	[0] */
#define R5_LINE_IN_N_GAIN_IC_1                    0x0    /* 000b	[3:1] */
#define R5_LINE_IN_P_GAIN_IC_1                    0x0    /* 000b	[6:4] */
#define R5_ENABLE_MIXER_IC_1_MASK                 0x1
#define R5_ENABLE_MIXER_IC_1_SHIFT                0
#define R5_LINE_IN_N_GAIN_IC_1_MASK               0xE
#define R5_LINE_IN_N_GAIN_IC_1_SHIFT              1
#define R5_LINE_IN_P_GAIN_IC_1_MASK               0x70
#define R5_LINE_IN_P_GAIN_IC_1_SHIFT              4

/* Record Mixer Left Ctrl 1 (IC 1) */
#define R6_REC_MIX_LFT_CTRL1_AUXING_IC_1          0x5    /* 101b	[2:0] */
#define R6_REC_MIX_LFT_CTRL1_PGABOOST_IC_1        0x0    /* 00b	[4:3] */
#define R6_REC_MIX_LFT_CTRL1_AUXING_IC_1_MASK     0x7
#define R6_REC_MIX_LFT_CTRL1_AUXING_IC_1_SHIFT    0
#define R6_REC_MIX_LFT_CTRL1_PGABOOST_IC_1_MASK   0x18
#define R6_REC_MIX_LFT_CTRL1_PGABOOST_IC_1_SHIFT  3

/* Record Mixer Right Ctrl 0 (IC 1) */
#define R7_RECMIX_RIGHT_CTRL0_ENABLE_IC_1         0x1    /* 1b	[0] */
#define R7_RECMIXRIGHT_CTRL0_NGAIN_IC_1           0x0    /* 000b	[3:1] */
#define R7_RECMIXRIGHT_CTRL0_PGAIN_IC_1           0x0    /* 000b	[6:4] */
#define R7_RECMIX_RIGHT_CTRL0_ENABLE_IC_1_MASK    0x1
#define R7_RECMIX_RIGHT_CTRL0_ENABLE_IC_1_SHIFT   0
#define R7_RECMIXRIGHT_CTRL0_NGAIN_IC_1_MASK      0xE
#define R7_RECMIXRIGHT_CTRL0_NGAIN_IC_1_SHIFT     1
#define R7_RECMIXRIGHT_CTRL0_PGAIN_IC_1_MASK      0x70
#define R7_RECMIXRIGHT_CTRL0_PGAIN_IC_1_SHIFT     4

/* Record Mixer Right Ctrl 1 (IC 1) */
#define R8_RECMIXRIGHT_CTRL1_AUXING_IC_1          0x5    /* 101b	[2:0] */
#define R8_RECMIXRIGHT_CTRL1_PGABOOST_IC_1        0x0    /* 00b	[4:3] */
#define R8_RECMIXRIGHT_CTRL1_AUXING_IC_1_MASK     0x7
#define R8_RECMIXRIGHT_CTRL1_AUXING_IC_1_SHIFT    0
#define R8_RECMIXRIGHT_CTRL1_PGABOOST_IC_1_MASK   0x18
#define R8_RECMIXRIGHT_CTRL1_PGABOOST_IC_1_SHIFT  3

